README.org
* Stuff                                                            :noexport:
- [ ] SDL_RenderCopy - ep 17 of SDL series, render texture into rectangle, use
  for squishing stuff into correct scaled tiles?
- [ ] popup imgui-window?
- [ ] character starting pos, do something with it?
- [ ] have an entity spawner, make many NPCs?
- [ ] animated character movement?
  - https://gamedev.net/forums/topic/689455-how-to-achieve-smooth-tile-based-movement-with-c-and-sdl/5347566/
  - https://www.parallelrealities.co.uk/tutorials/tbs/tbs1.php "Simply
    interpolate between the old and new positions in the grid and ignore input
    during the animation."
- [X] use isometric?
- [ ] game scenes management using state machines. Have a render() method, for
  different game modes. [[https://gamedevelopment.tutsplus.com/articles/how-to-build-a-jrpg-a-primer-for-game-developers--gamedev-6676][jrpg]], or use a state stack
  - Next Actions:
    - Implement the state machine code in your favorite programming language.
    - Create a MenuMenuState and GameState inheriting from IState.
    - Set the the main menu state as the initial state.
    - Have both states render different images.
    - On pressing a button, have the state change from the main menu to the game state.

FSM, blog post based on the book:
http://www.richardssoftware.net/Home/Post/67

DEPTH SORTING:
"For properly understanding depth sorting, we must understand that whenever the
character's x- and y-coordinates are less than those of the tree, the tree
overlaps the character. Whenever the character's x- and y-coordinates are
greater than that of the tree, the character overlaps the tree.

When they have the same x-coordinate, then we decide based on the y-coordinate
alone: whichever has the higher y-coordinate overlaps the other. When they
have same y-coordinate then we decide based on the x-coordinate alone:
whichever has the higher x-coordinate overlaps the other.

A simplified version of this is to just sequentially draw the levels starting
from the farthest tile - that is, tile[0][0] - then draw all the tiles in each
row one by one. If a character occupies a tile, we draw the ground tile first
and then render the character tile. This will work fine, because the character
cannot occupy a wall tile.

Depth sorting must be done every time any tile changes position. For instance,
we need to do it whenever characters move. We then update the displayed scene,
after performing the depth sort, to reflect the depth changes."


** On Singletons
#+begin_example
<impaktor> Am I understanding this right: If I have a singleton class Foo,
           that I initiate in my main(), can I then access it (e.g.
           Foo::DoStuff()) from any implementation file, by #include "Foo.h"?
                                                                        [21:44]
<Gliese852> impaktor: I think yes, but the definition of a static object
            variable should be in Foo.cpp, if I understand  [21:54]
<Gliese852> if you put it in Foo.h, it will go into each object file, and each
            will have its own singleton  [21:55]
<Gliese852> because #include "Foo.h" is nothing more than text substitution
                                                                        [21:56]
<impaktor> But will I not have to declare the singleton class in Foo.h? And
           implement it in Foo.cpp?  [21:58]
<impaktor> I note DynV hasn't posted on the forum since we moved all the posts
           to a sub-forum.  [22:37]
<Gliese852> impaktor: Yes, this is usually done, but it is not necessary.
                                                                        [22:42]
<impaktor> So I don't need to #include Foo? Hmmm... I should do some
           experiments.  [22:44]

<Gliese852> impaktor: you could put both the declaration and the definition in
            Foo.h, but not this time. [22:08:34]
<sturnclaw> impaktor: you still need to include Foo.h, the difference is
            whether you are storing an instance of Foo somewhere and using it
            as `m_foo->DoStuff()` or using the singleton pattern
            `Foo::Get()->DoStuff()` [01:19:27]
<sturnclaw> you can treat Foo as a static class though, where there are no
            non-static member variables or functions, in which case you'd call
            Foo::DoStuff() directly [01:19:57]

#+end_example

** On ImGui:
#+begin_example
<sturnclaw> you should always do
            if (ImGui::Begin(...)) {
            /* ... */
            }
            ImGui::End()  [08:58]
<sturnclaw> window visibility is stored separately from the call to Begin, and
            while you can submit draw commands even if the window isn't
            visible, they're just silently ignored (but still wasteful)
<sturnclaw> Generally speaking though, the call to Begin takes a boolean to
            update if the window is closed, Begin() returns false if the
            window is collapsed but whether the window is shown at all or not
            is higher-level application code  [08:59]
<impaktor> ImGui::Begin() returns false if the window isn't opened?  [09:00]
<sturnclaw> you most likely should have a top-level IsDebugWindowOpen bool
            accessible through your debug interface somehow
<sturnclaw> returns false if the window isn't visible
<sturnclaw> the call to Begin mutates the pointer-to-bool passed to it if the
            user clicks the close button, then it's the calling code's
            responsibility to not call ImGui::Begin()  [09:01]
<sturnclaw> you're responsible for not calling ImGui::Begin() if the window is
            "closed"  [09:04]
<sturnclaw> (you're also responsible for not submitting primitives if the
            window signals the contents aren't visible by returning false)
<impaktor> Thanks! I'm not fully understanding (I don't have the code to
           experiment on now), but would the objects that push strings to the
           debug windwow also have to use IsDebugWindowOpen ?  [09:05]
#+end_example

** Other good RPGs
   *Phantasy star IV [Genesis]*
   *Chrono Trigger [SNES]*
   Earth Bound [SNES]
   *Final Fantasy III (aka VI)*
   Phantasy star II [Genesis]
   Final Fantasy 1

* Description
  This is my playground for implementing a 2D RPG like SDL based game which
  aims to be a proof of concept for "[[https://forum.pioneerspacesim.net/viewtopic.php?f=3&t=454][waling on base]]" in the game [[https://github.com/pioneerspacesim/pioneer][Pioneer Space Simulator]].

  I imagine, you can control your whole crew, for x-com/laser squad style of
  turn based combat, when doing missions or boarding and fighting control over
  a ship that has been disabled with an EMP missile.

  Graphics should ideally be at least similar to [[https://github.com/CeRiAl/libsyndicate][syndicate]], or Jagged Alliance
  2 (although, in syndicate, movement was independent of tile grid, something
  I don't plan to do here, for simplicity sake).

** Features
   - Load Orthogonal maps from [[https://www.mapeditor.org/][tiled]], support:
     - multiple tilesets
     - multiple layers. Any tile in a layer called =collisions= will be used for collision detection.
     - Support (single) object layer, if named =GameObjects=, and each object
       has a unique name, e.g.
       - "start"
       - "bar"
* Roadmap - My path to glory
  Road map.

** Getting started

 - [X] Make git repository
 - [X] Draw a SDL window
 - [X] handle keyboard event, ESC and Q
 - [X] handle closing window with clicking "x" (I think this is done, not sure)
 - [X] wait/sleep lopp with fixed FPS to cap CPU usage
 - [X] load an image/sprite
 - [X] Have a dot that I can move around with arrow keys
 - [X] Map can scroll when dot approaches edge of screen

** Set up map
   - [X] Load tiles from file.
   - [X] Make first map: wall, floor, door, computer terminal, counter
   - [ ] [[http://archive.gamedev.net/archive/reference/articles/article729.html][Line of sight]] / "Fog of war" in rooms I can not see into / rooms I'm not in ([[https://www.redblobgames.com/articles/visibility/][link]])
   - [X] Read in map from a simple file
   - [X] Use third party map making tool. Like [[https://www.mapeditor.org/][Tiled]], if so read [[http://gamedev.tutsplus.com/tutorials/level-design/introduction-to-tiled-map-editor/][introduction]]
     and how to implement it [[http://gamedev.tutsplus.com/tutorials/implementation/parsing-tiled-tmx-format-maps-in-your-own-game-engine/][here]]. (Another editor is ogmo covered [[http://gamedevelopment.tutsplus.com/tutorials/getting-to-know-ogmo-editor-an-advanced-and-robust-level-editor--gamedev-3843][here]].) For
     Tiled, save maps in json format (since Pioneer uses json), and implement:
     - [X] Hook in jsoncpp.
     - [X] Read in maps. Useful: [[https://github.com/bjorn/tiled/wiki/JSON-Map-Format][Tiled: json-format]] and [[https://en.wikibooks.org/wiki/JsonCpp][jsoncpp]]-documentation.
     - [X] Support multiple layers
     - [X] Support multiple tile sets
   - [X] Find some tile set. http://opengameart.org/
   - [X] support collision checks with walls (us "collision" layer)
   - [ ] Trigger tiles: doors switch to indoor map, computer terminal, stairs
   - [ ] zoom camera? / map? ([[https://discourse.libsdl.org/t/sdl2-zoom-tile-map-with-ui/25460][example]])
   - [X] show layers, e.g. collision layer, for debugging maps
   - [ ] Animated tiles? E.g. fire, explosion, smoke, water?
   - [ ] Animated (character) sprite movement
   - [ ] Support isometric map ([[https://en.wikipedia.org/wiki/Isometric_video_game_graphics][wiki]]), although technically, it is actually [[https://www.significant-bits.com/a-laymans-guide-to-projection-in-videogames/][dimetric]]
     - Find placeholder tile sets: [[https://opengameart.org/][opengameart.org]] [[https://www.kenney.nl/assets][kenney.nl]] [[https://assetforge.io/][assetforge.io]]
     - Might it be interesting to convert existing 3D models to isometric
       tiles: http://crocotile3d.com?
