README.md
# Table of Contents

1.  [Description](#org61c5dda)
    1.  [Features](#org6fa52ca)
2.  [Roadmap - My path to glory](#orgef3bbe2)
    1.  [Getting started](#orgdae5570)
    2.  [Set up map](#org8171953)
    3.  [NPCs](#org571ed2a)
    4.  [ImGui](#org2010e42)
    5.  [Follow up goals](#orge047d72)
    6.  [Integration into Pioneer Space Simulator](#org10b528c)
        1.  [Before - sanitize code](#orgfc20c14)
        2.  [Minimum feature set for inclusion](#orgdddfa20)
        3.  [Show ships in hangar?](#org57e5fdf)
    7.  [Combat system](#org52cf3bd)
    8.  [Above and beyond](#orgc4e3d48)
3.  [Resources](#orgf4f64ed)
    1.  [RPG / Game Programming](#org107a20d)
    2.  [General C++](#orgab65757)


<a id="org61c5dda"></a>

# Description

This is my playground for implementing a 2D RPG like SDL based game which
aims to be a proof of concept for "[waling on base](https://forum.pioneerspacesim.net/viewtopic.php?f=3&t=454)" in the game [Pioneer Space Simulator](https://github.com/pioneerspacesim/pioneer).

I imagine, you can control your whole crew, for x-com/laser squad style of
turn based combat, when doing missions or boarding and fighting control over
a ship that has been disabled with an EMP missile.

Graphics should ideally be at least similar to [syndicate](https://github.com/CeRiAl/libsyndicate), or Jagged Alliance
2 (although, in syndicate, movement was independent of tile grid, something
I don't plan to do here, for simplicity sake).


<a id="org6fa52ca"></a>

## Features

-   Load Orthogonal maps from [tiled](https://www.mapeditor.org/), support:
    -   multiple tilesets
    -   multiple layers. Any tile in a layer called `collisions` will be used for collision detection.
    -   Support (single) object layer, if named `GameObjects`, and each object
        has a unique name, e.g.
        -   "start"
        -   "bar"


<a id="orgef3bbe2"></a>

# Roadmap - My path to glory

Road map.


<a id="orgdae5570"></a>

## Getting started

-   [X] Make git repository
-   [X] Draw a SDL window
-   [X] handle keyboard event, ESC and Q
-   [X] handle closing window with clicking "x" (I think this is done, not sure)
-   [X] wait/sleep lopp with fixed FPS to cap CPU usage
-   [X] load an image/sprite
-   [X] Have a dot that I can move around with arrow keys
-   [X] Map can scroll when dot approaches edge of screen


<a id="org8171953"></a>

## Set up map

-   [X] Load tiles from file.
-   [X] Make first map: wall, floor, door, computer terminal, counter
-   [ ] [Line of sight](http://archive.gamedev.net/archive/reference/articles/article729.html) / "Fog of war" in rooms I can not see into / rooms I'm not in ([link](https://www.redblobgames.com/articles/visibility/))
-   [X] Read in map from a simple file
-   [X] Use third party map making tool. Like [Tiled](https://www.mapeditor.org/), if so read [introduction](http://gamedev.tutsplus.com/tutorials/level-design/introduction-to-tiled-map-editor/)
    and how to implement it [here](http://gamedev.tutsplus.com/tutorials/implementation/parsing-tiled-tmx-format-maps-in-your-own-game-engine/). (Another editor is ogmo covered [here](http://gamedevelopment.tutsplus.com/tutorials/getting-to-know-ogmo-editor-an-advanced-and-robust-level-editor--gamedev-3843).) For
    Tiled, save maps in json format (since Pioneer uses json), and implement:
    -   [X] Hook in jsoncpp.
    -   [X] Read in maps. Useful: [Tiled: json-format](https://github.com/bjorn/tiled/wiki/JSON-Map-Format) and [jsoncpp](https://en.wikibooks.org/wiki/JsonCpp)-documentation.
    -   [X] Support multiple layers
    -   [X] Support multiple tile sets
-   [X] Find some tile set. <http://opengameart.org/>
-   [X] support collision checks with walls (us "collision" layer)
-   [ ] Trigger tiles: doors switch to indoor map, computer terminal, stairs
-   [ ] zoom camera? / map? ([example](https://discourse.libsdl.org/t/sdl2-zoom-tile-map-with-ui/25460))
-   [X] show layers, e.g. collision layer, for debugging maps
-   [ ] Animated tiles? E.g. fire, explosion, smoke, water?
-   [ ] Animated (character) sprite movement
-   [X] Support isometric map ([wiki](https://en.wikipedia.org/wiki/Isometric_video_game_graphics)), although technically, it is actually [dimetric](https://www.significant-bits.com/a-laymans-guide-to-projection-in-videogames/)
    -   Find placeholder tile sets: [opengameart.org](https://opengameart.org/) [kenney.nl](https://www.kenney.nl/assets) [assetforge.io](https://assetforge.io/)
    -   Might it be interesting to convert existing 3D models to isometric
        tiles: <http://crocotile3d.com>?
