README.org
** NPCs
   - [X] separate out to character class,
   - [X] Separate [[https://github.com/kennycason/sdl_sprite][class for loading sprites]], support direction, different sprite sheets, different height/width of src sprites
   - [X] Separate [[https://gafferongames.com/post/fix_your_timestep/][physics updates]] from [[https://thenumb.at/cpp-course/sdl2/08/08.html][frame rate]] (or modulo ticks)
   - [X] [[https://gamedevelopment.tutsplus.com/series/how-to-adapt-a-pathfinding-to-a-2d-grid-based-platformer--cms-882][A* pathfinding]], or [[https://medium.com/@nicholas.w.swift/easy-a-star-pathfinding-7e6689c7f7b2][medium article]], examples [[https://www.redblobgames.com/pathfinding/a-star/implementation.html][here]], [[https://github.coventry.ac.uk/jansonsa/D1/blob/master/pokemonGUI/pokemonGUI/Cordinate.h][here]], [[https://github.com/quantumelixir/pathfinding][here]], or:
     - C++11: https://github.com/daancode/a-star
     - C++14: https://github.com/Rikora/A-star
     - C++14 & "C++11?": https://www.geeksforgeeks.org/a-search-algorithm/
   - [X] Implement a Finite State Machine system, for AI (Hierarchical FSM
     seems useful e.g. have one for ranged combat, one for close combat, etc.)
   - [ ] Imgui debug window listing NPCs, can select in table, get detailed
     view e.g. of state
   - [ ] Can search an NPCs name/ID tag, and mark/change color of character sprite
   - [ ] Support collision check between characters [[http://lazyfoo.net/tutorials/SDL/27_collision_detection/index.php][tutorial]]

   - [ ] mouse integration
     - [ ] click sets destination for player
     - [ ] click NPC, to give action (e.g. show name & stats, for now)
** ImGui
   - [X] Support [[https://github.com/ocornut/imgui][imgui]] ([[file:~/usr/src/imgui/examples/example_sdl2_sdlrenderer/main.cpp][example]] using only SDLrender).
   - [X] Basic debug print outs
   - [ ] print coordinates of clicked tile?
   - [ ] bouncing into computer terminal - BBS
   - [ ] bouncing into NPC:
     - [ ] fight / deliver package / ask
     - [ ] bartender: ask advice
     - [ ] fixers: illegal mission

** Follow up goals
   Longer term goals, rough outline.

   - [ ] Create maps of different stations
     - [ ] Station has a bar, with chairs, tables, bar-counter, bartender
     - [ ] Station has a police "station"/terminal
     - [ ] Station has a BBS terminal
     - [ ] Station has a commodity terminal
   - [ ] Player has a wrist "[[http://fallout.wikia.com/wiki/Pip-Boy][Pip-boy]]" computer, for "Pioneer F3 Info view"?
   - [ ] Player/NPC has an inventory? Mechanics for dropping/picking up items?
   - [ ] Manually prompt to set player stats when starting new game. Strength,
     dexterity, speed, rifle skill, blade skill, gun skill, throw skill, looks
** Integration into Pioneer Space Simulator
   At this point, the game could be included into Pioneer:
*** Before - sanitize code
   - Rename variables and class names to have consistent naming standard.
   - Rename files
   - Fix project structure, =contrib/= , =src/=, =data=
   - Run valgrind to find any memory leaks
   - Run clang-format to format code
*** Minimum feature set for inclusion
    - When player lands on a station, the "walk on base" game takes over

    - The player is placed in the main lobby, behind is a closed door to the
      ship hangar. Ships are not shown (that is for later).

    - One, or maybe two different station maps. (Could also have faction logo
      on floor tiles in the entrance of the lobby)

    - NPCs walk around, walking up to them opens chat dialogue. They could all
      be dismissive (for now).

    - Player has to access computer terminals on the station to open
      BBS-screen, commodity market, ship market, ship equipment shop, and
      police.

    - DeliverPackage now requires player not only to land at the right base,
      but also find the right person to deliver the package to. Walk up to
      person and engage in conversation.

    - Assassination missions are moved from BBS list, to be accessible
      through conversation with special shady people in the Bar. (Until
      person-to-person combat is implemented, the assassination itself is
      unchanged, i.e. must target the ship)

    - Black market (both the real, and the police/fake) moved from BBS to
      NPC(s) sitting in the bar.

    - Advice module moved to be conversations with the Bartender, e.g.

      - "You look like a rookie. You want a word of advice, make sure never to
        travel into uninhabited systems with too little fuel to jump back out"

      - "I've seen your kind before. You're looking hungry for adventure, kid,
        but I'd be surprised if you're still alive come the end of the year"

*** Show ships in hangar?
    This would be the main place in the game where the player would get a
    sense of scale of different ships!

    This isn't crucial, but would, after combat is implemented, allow
    disabling enemy ships in space, with special energy weapons, dock with
    them, board them, and engage in hand-to-hand combat, to then loot their
    cargo/crew.

    - Maps have a hangar, and each ship has a multi-tile set
      representation that are tiled together to one full ship.

    - Each ship has an internal "map", with cockpit, hall/entrance, cargo bay
      (filled with crates depending on state of cargo hold), and personal crew
      cabins, (and (room for?) passenger cabins?).

    - Player enters/leaves ship by walking up to the cockpit chair inside
      the ship. Leaves ship by walking up to the door of the ship (/ and/or
      cargo loading bay?).

** Combat system
   When engaging in combat, game switches over to turn based. Combat could be
   similar to X-com, or some GURPS based system. Key here, is the ability to
   control several characters, making out your crew.

   - Combat:
     - Choose your weapon, & action (stab/slash/punch)
     - Choose enemy body part, from a list, or ideally a silhouette image
     - Attack is carried out, uses up action points / time units
     - NPCs make their move

   - Health system, overall health + specific body part health, bleeding to
     death, poison, drugs?
     - Hospital/treatment facility/doctor/medi-kit

   - Personal equipment shop to facilitate combat: knifes, pistols, rifle,
     sniper rifle, medi-kit, body armour, helmet, night vision, grenade (smoke
     & explosive), timed charge, stun-rod, maze

   - Patrolling NPC-police on base, enforcing law, attacking you if they see
     you attack someone (i.e. need a line-of-sight-calculation). If they
     disable you, what then? Initially only Thuderdome outcome: two men enter,
     one man leaves.

   - Note to self: read:
     - [[https://gamedevelopment.tutsplus.com/series/balancing-turn-based-rpgs--gamedev-12702][Balancing Turn-Based RPGs]]
     - [[https://gamedevelopment.tutsplus.com/articles/how-to-build-a-jrpg-a-primer-for-game-developers--gamedev-6676][How to Build a JRPG: A Primer for Game Developers]]
       "The combat flow is controlled using a state machine with two states;
       one state to tick the actions and another state to execute the top
       action when the time comes. "
