README.org
** Above and beyond
   - NPC / player can drink beer in bar, and get drunk, introducing noise to
     the path finding algorithm?

   - Passengers or crew can attack you on your ship, switching pioneer to the
     "walk on base" state (but technically "walk on ship").

   - Can player use more subtle ways of affecting game world than grenades and
     projectile weapons? Like putting poison in someones drink in the bar?
     Setting bomb with delayed timer, and leaving (similar to X-Com UFO/TFTD)?

   - Can player use his crew as a tactical combat team on the ground? Would
     player have full control of them during combat, or they fight independent
     of you, by targeting your enemies? Could you assign targets to them, and
     crew would fight them? How would they behave in a cloud of smoke, with
     zero view?

   - What can be done to make bases on different locations look different, or
     have their own "feel"? Do [[https://ijdykeman.github.io/ml/2017/10/12/wang-tile-procedural-generation.html][procedural generated bases]], randomly generated
     [[http://beckylavender.co.uk/portfolio/the-zelda-dungeon-generator/][zelda maps]], or wave [[https://selfsame.itch.io/unitywfc][function collapse]].

   - Cut scene system? If we have nice graphics/art to display, for immersion.
     E.g. for quests.

   - Very far out suggestion: Some bases/bars could have arcade machines, with
     mini-games. Pong/pac-man/card-game?/frogger (Doom!). Tie these into the
     story: leaving secret messages to others through what you type in the
     high score list? I.e. you would have to play the game (well enough) to
     get into high score list (or unplug arcade machine to reset it)? This is
     more like an adventure game elements thingy.

   - Have an [[https://gamedev.stackexchange.com/questions/38289/embed-if-text-parser-in-another-game][embedded]] interactive fiction engine? Could be used when going on
     quest into the city / bad lands.

* Resources
  Useful articles to read, or have read.
** RPG / Game Programming
   - [[https://gameprogrammingpatterns.com/contents.html][Game Programming Patterns]] - Robert Nystrom (free web book)

   - [[http://www-cs-students.stanford.edu/~amitp/gameprog.html][Amit’s Game Programming Information]] (many links)
     - [[https://www.redblobgames.com/][Red Blob Games from Amit Patel]]

   - Programming Game AI [[https://github.com/wangchen/Programming-Game-AI-by-Example-src][by Example]] - Mat Buckland

   - [[http://www.gameaipro.com/][Game AI Pro – Online Edition 2021]]

   - [[http://howtomakeanrpg.com/a/how-to-make-an-rpg-release.html][How to Make an RPG (Book)]] - Dan Schuller

   - [[http://gamedevelopment.tutsplus.com/articles/how-to-build-a-jrpg-a-primer-for-game-developers--gamedev-6676][How to Build a JRPG: A Primer for Game Developers]] - Good primer on game states

   - Isometric maps & art
     - [[http://gamedevelopment.tutsplus.com/tutorials/creating-isometric-worlds-a-primer-for-game-developers--gamedev-6511][Creating Isometric Worlds: A Primer for Game Developers]] - Very useful
     - [[https://gamedevelopment.tutsplus.com/tutorials/creating-isometric-worlds-a-primer-for-game-developers-continued--gamedev-9215][Creating Isometric Worlds: A Primer for Game Developers, Continued]] - Isometric scrolling
     - [[https://gamedevelopment.tutsplus.com/tutorials/quick-tip-cheap-n-easy-isometric-levels--gamedev-6282][Quick Tip: Cheap 'n' Easy Isometric Levels]] - on depth sorting
     - [[http://www.gotoandplay.it/_articles/2004/10/tcgtipa.php][The Complete Guide to Isometric Pixel Art]] - drawing basic objects, colouring, lighting, texturing

   - Pathfinding
     - [[http://gamedev.tutsplus.com/tutorials/implementation/speed-up-a-star-pathfinding-with-the-jump-point-search-algorithm/][How to Speed Up A* Pathfinding With the Jump Point Search Algorithm]] - If need faster path finding
     - [[http://gamedevelopment.tutsplus.com/tutorials/understanding-goal-based-vector-field-pathfinding--gamedev-9007][Understanding Goal-Based Vector Field Pathfinding]] - For alternative path finding?
     - [[http://www.richardssoftware.net/Home/Post/46][Pathfinding 1: Map Representation and Preprocessing]]
** General C++
   - [[https://cplusplus.com/doc/tutorial/][cplusplus]]
   - [[https://en.cppreference.com/w/cpp][cppreference.com]]
   - [[https://www.learncpp.com/][Learn C++]]
   - [[https://github.com/aras-p/ClangBuildAnalyzer][ClangBuildAnalyzer]] - Play with this, to learn how to reduce compile time (even if not needed):
   - Mike Shah tutorials: [[https://www.youtube.com/watch?v=ILgiCy6IXLw&list=PLvv0ScY6vfd9wBflF0f6ynlDQuaeKYzyc][design pattern]], [[https://www.youtube.com/watch?v=QM4WW8hcsPU&list=PLvv0ScY6vfd-p1gSnbQhY7vMe2rng0IL0][SDL2]], [[https://www.youtube.com/watch?v=Q7vm264YNrM&list=PLvv0ScY6vfd9zlZkIIqGDeG5TUWswkMox][openGL]], [[https://www.youtube.com/watch?v=LGOgNqkRMs0&list=PLvv0ScY6vfd8j-tlhYVPYgiIyXduu6m-L][C++]], [[https://www.youtube.com/watch?v=Fn0xBsmact4&list=PLvv0ScY6vfd_ocTP2ZLicgqKnvq50OCXM][Modern C++]]
** General Common lisp game programming                            :noexport:
   https://github.com/lispgames/lispgames.github.io/wiki

** Common Lisp + OpenGL                                            :noexport:
   http://nklein.com/2010/06/nehe-tutorials-for-cl-opengl/
   http://nklein.com/2010/06/nehe-tutorial-02-drawing-triangles-and-quadrilaterals/
   http://nklein.com/2010/06/nehe-tutorial-03-color/
   http://nklein.com/2010/06/nehe-tutorial-04-rotation/
   http://nklein.com/2010/06/nehe-tutorial-05-solids/
   http://nklein.com/2010/06/nehe-tutorial-06-textured-solids/
