README.md


<a id="orgc4e3d48"></a>

## Above and beyond

-   NPC / player can drink beer in bar, and get drunk, introducing noise to
    the path finding algorithm?

-   Passengers or crew can attack you on your ship, switching pioneer to the
    "walk on base" state (but technically "walk on ship").

-   Can player use more subtle ways of affecting game world than grenades and
    projectile weapons? Like putting poison in someones drink in the bar?
    Setting bomb with delayed timer, and leaving (similar to X-Com UFO/TFTD)?

-   Can player use his crew as a tactical combat team on the ground? Would
    player have full control of them during combat, or they fight independent
    of you, by targeting your enemies? Could you assign targets to them, and
    crew would fight them? How would they behave in a cloud of smoke, with
    zero view?

-   What can be done to make bases on different locations look different, or
    have their own "feel"? Do [procedural generated bases](https://ijdykeman.github.io/ml/2017/10/12/wang-tile-procedural-generation.html), randomly generated
    [zelda maps](http://beckylavender.co.uk/portfolio/the-zelda-dungeon-generator/), or wave [function collapse](https://selfsame.itch.io/unitywfc).

-   Cut scene system? If we have nice graphics/art to display, for immersion.
    E.g. for quests.

-   Very far out suggestion: Some bases/bars could have arcade machines, with
    mini-games. Pong/pac-man/card-game?/frogger (Doom!). Tie these into the
    story: leaving secret messages to others through what you type in the
    high score list? I.e. you would have to play the game (well enough) to
    get into high score list (or unplug arcade machine to reset it)? This is
    more like an adventure game elements thingy.

-   Have an [embedded](https://gamedev.stackexchange.com/questions/38289/embed-if-text-parser-in-another-game) interactive fiction engine? Could be used when going on
    quest into the city / bad lands.


<a id="orgf4f64ed"></a>

# Resources

Useful articles to read, or have read.


<a id="org107a20d"></a>

## RPG / Game Programming

-   [Game Programming Patterns](https://gameprogrammingpatterns.com/contents.html) - Robert Nystrom (free web book)

-   [Amit’s Game Programming Information](http://www-cs-students.stanford.edu/~amitp/gameprog.html) (many links)
    -   [Red Blob Games from Amit Patel](https://www.redblobgames.com/)

-   Programming Game AI [by Example](https://github.com/wangchen/Programming-Game-AI-by-Example-src) - Mat Buckland

-   [Game AI Pro – Online Edition 2021](http://www.gameaipro.com/)

-   [How to Make an RPG (Book)](http://howtomakeanrpg.com/a/how-to-make-an-rpg-release.html) - Dan Schuller

-   [How to Build a JRPG: A Primer for Game Developers](http://gamedevelopment.tutsplus.com/articles/how-to-build-a-jrpg-a-primer-for-game-developers--gamedev-6676) - Good primer on game states

-   Isometric maps & art
    -   [Creating Isometric Worlds: A Primer for Game Developers](http://gamedevelopment.tutsplus.com/tutorials/creating-isometric-worlds-a-primer-for-game-developers--gamedev-6511) - Very useful
    -   [Creating Isometric Worlds: A Primer for Game Developers, Continued](https://gamedevelopment.tutsplus.com/tutorials/creating-isometric-worlds-a-primer-for-game-developers-continued--gamedev-9215) - Isometric scrolling
    -   [Quick Tip: Cheap 'n' Easy Isometric Levels](https://gamedevelopment.tutsplus.com/tutorials/quick-tip-cheap-n-easy-isometric-levels--gamedev-6282) - on depth sorting
    -   [The Complete Guide to Isometric Pixel Art](http://www.gotoandplay.it/_articles/2004/10/tcgtipa.php) - drawing basic objects, colouring, lighting, texturing

-   Pathfinding
    -   [How to Speed Up A\* Pathfinding With the Jump Point Search Algorithm](http://gamedev.tutsplus.com/tutorials/implementation/speed-up-a-star-pathfinding-with-the-jump-point-search-algorithm/) - If need faster path finding
    -   [Understanding Goal-Based Vector Field Pathfinding](http://gamedevelopment.tutsplus.com/tutorials/understanding-goal-based-vector-field-pathfinding--gamedev-9007) - For alternative path finding?
    -   [Pathfinding 1: Map Representation and Preprocessing](http://www.richardssoftware.net/Home/Post/46)


<a id="orgab65757"></a>

## General C++

-   [cplusplus](https://cplusplus.com/doc/tutorial/)
-   [cppreference.com](https://en.cppreference.com/w/cpp)
-   [Learn C++](https://www.learncpp.com/)
-   [ClangBuildAnalyzer](https://github.com/aras-p/ClangBuildAnalyzer) - Play with this, to learn how to reduce compile time (even if not needed):
-   Mike Shah tutorials: [design pattern](https://www.youtube.com/watch?v=ILgiCy6IXLw&list=PLvv0ScY6vfd9wBflF0f6ynlDQuaeKYzyc), [SDL2](https://www.youtube.com/watch?v=QM4WW8hcsPU&list=PLvv0ScY6vfd-p1gSnbQhY7vMe2rng0IL0), [openGL](https://www.youtube.com/watch?v=Q7vm264YNrM&list=PLvv0ScY6vfd9zlZkIIqGDeG5TUWswkMox), [C++](https://www.youtube.com/watch?v=LGOgNqkRMs0&list=PLvv0ScY6vfd8j-tlhYVPYgiIyXduu6m-L), [Modern C++](https://www.youtube.com/watch?v=Fn0xBsmact4&list=PLvv0ScY6vfd_ocTP2ZLicgqKnvq50OCXM)
